app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id


      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "it was cool movie"], ["created_at", 2017-04-19 10:03:35 UTC], ["updated_at", 2017-04-19 10:03:35 UTC], ["user_id", 1], ["movie_id", 2]]